In [6]:
import pandas as pd
df = pd.read_csv("salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [8]:
inputs = df.drop('salary_more_then_100k', axis=1)
target = df['salary_more_then_100k']

In [9]:
from sklearn.preprocessing import LabelEncoder

In [10]:
e_company = LabelEncoder()
e_job = LabelEncoder()
e_degree = LabelEncoder()

In [11]:
inputs['e_company'] = e_company.fit_transform(inputs['company'])
inputs['e_job'] = e_company.fit_transform(inputs['job'])
inputs['e_degree'] = e_company.fit_transform(inputs['degree'])
inputs.head()

  company                  job     degree  e_company  e_job  e_degree
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [12]:
e_inputs = inputs.drop(['company', 'job', 'degree'], axis=1)
e_inputs

    e_company  e_job  e_degree
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [13]:
from sklearn import tree

In [14]:
model = tree.DecisionTreeClassifier()

In [15]:
model.fit(e_inputs, target)

DecisionTreeClassifier()

In [16]:
model.score(e_inputs, target)

1.0

In [18]:
model.predict([[2, 1, 0]])

array([0], dtype=int64)